### Obtain

In [1]:
import pandas as pd
import matplotlib as plt
import numpy as np
import seaborn as sns

In [2]:
df = pd.read_csv('kc_house_data.csv')

In [3]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,10/13/2014,221900.0,3,1.00,1180,5650,1.0,NaN,0.0,...,7,1180,0.0,1955,0.0,98178,47.5112,-122.257,1340,5650
1,6414100192,12/9/2014,538000.0,3,2.25,2570,7242,2.0,0.0,0.0,...,7,2170,400.0,1951,1991.0,98125,47.7210,-122.319,1690,7639
2,5631500400,2/25/2015,180000.0,2,1.00,770,10000,1.0,0.0,0.0,...,6,770,0.0,1933,NaN,98028,47.7379,-122.233,2720,8062
3,2487200875,12/9/2014,604000.0,4,3.00,1960,5000,1.0,0.0,0.0,...,7,1050,910.0,1965,0.0,98136,47.5208,-122.393,1360,5000
4,1954400510,2/18/2015,510000.0,3,2.00,1680,8080,1.0,0.0,0.0,...,8,1680,0.0,1987,0.0,98074,47.6168,-122.045,1800,7503

### Scrub

In [6]:
df = df.drop(columns="id") ## drop 'id' column
df.head(0)

Empty DataFrame
Columns: [date, price, bedrooms, bathrooms, sqft_living, sqft_lot, floors, waterfront, view, condition, grade, sqft_above, sqft_basement, yr_built, yr_renovated, zipcode, lat, long, sqft_living15, sqft_lot15]
Index: []

In [7]:
df.head()

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,10/13/2014,221900.0,3,1.00,1180,5650,1.0,NaN,0.0,3,7,1180,0.0,1955,0.0,98178,47.5112,-122.257,1340,5650
1,12/9/2014,538000.0,3,2.25,2570,7242,2.0,0.0,0.0,3,7,2170,400.0,1951,1991.0,98125,47.7210,-122.319,1690,7639
2,2/25/2015,180000.0,2,1.00,770,10000,1.0,0.0,0.0,3,6,770,0.0,1933,NaN,98028,47.7379,-122.233,2720,8062
3,12/9/2014,604000.0,4,3.00,1960,5000,1.0,0.0,0.0,5,7,1050,910.0,1965,0.0,98136,47.5208,-122.393,1360,5000
4,2/18/2015,510000.0,3,2.00,1680,8080,1.0,0.0,0.0,3,8,1680,0.0,1987,0.0,98074,47.6168,-122.045,1800,7503

In [8]:
df.info() # check datatypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21597 entries, 0 to 21596
Data columns (total 20 columns):
date             21597 non-null object
price            21597 non-null float64
bedrooms         21597 non-null int64
bathrooms        21597 non-null float64
sqft_living      21597 non-null int64
sqft_lot         21597 non-null int64
floors           21597 non-null float64
waterfront       19221 non-null float64
view             21534 non-null float64
condition        21597 non-null int64
grade            21597 non-null int64
sqft_above       21597 non-null int64
sqft_basement    21597 non-null object
yr_built         21597 non-null int64
yr_renovated     17755 non-null float64
zipcode          21597 non-null int64
lat              21597 non-null float64
long             21597 non-null float64
sqft_living15    21597 non-null int64
sqft_lot15       21597 non-null int64
dtypes: float64(8), int64(10), object(2)
memory usage: 3.3+ MB

'date' may have to be converted to int64 somehow. Or Age could be calculated from it

floors needs conversion. why would there be non-integer floors?

sqft_basement needs conversion to float or integer

yr_renovated be made integer

#### Changing Datatypes

In [13]:
df.floors.describe()

count    21597.000000
mean         1.494096
std          0.539683
min          1.000000
25%          1.000000
50%          1.500000
75%          2.000000
max          3.500000
Name: floors, dtype: float64

In [14]:
df.floors.unique()

array([1. , 2. , 1.5, 3. , 2.5, 3.5])

there seems to be a reason for # floors. will keep, may change to categorical var later

In [15]:
df.sqft_basement.describe()

count     21597
unique      304
top         0.0
freq      12826
Name: sqft_basement, dtype: object

In [22]:
df.sqft_basement.unique().tolist()

['0.0',
 '400.0',
 '910.0',
 '1530.0',
 '?',
 '730.0',
 '1700.0',
 '300.0',
 '970.0',
 '760.0',
 '720.0',
 '700.0',
 '820.0',
 '780.0',
 '790.0',
 '330.0',
 '1620.0',
 '360.0',
 '588.0',
 '1510.0',
 '410.0',
 '990.0',
 '600.0',
 '560.0',
 '550.0',
 '1000.0',
 '1600.0',
 '500.0',
 '1040.0',
 '880.0',
 '1010.0',
 '240.0',
 '265.0',
 '290.0',
 '800.0',
 '540.0',
 '710.0',
 '840.0',
 '380.0',
 '770.0',
 '480.0',
 '570.0',
 '1490.0',
 '620.0',
 '1250.0',
 '1270.0',
 '120.0',
 '650.0',
 '180.0',
 '1130.0',
 '450.0',
 '1640.0',
 '1460.0',
 '1020.0',
 '1030.0',
 '750.0',
 '640.0',
 '1070.0',
 '490.0',
 '1310.0',
 '630.0',
 '2000.0',
 '390.0',
 '430.0',
 '850.0',
 '210.0',
 '1430.0',
 '1950.0',
 '440.0',
 '220.0',
 '1160.0',
 '860.0',
 '580.0',
 '2060.0',
 '1820.0',
 '1180.0',
 '200.0',
 '1150.0',
 '1200.0',
 '680.0',
 '530.0',
 '1450.0',
 '1170.0',
 '1080.0',
 '960.0',
 '280.0',
 '870.0',
 '1100.0',
 '460.0',
 '1400.0',
 '660.0',
 '1220.0',
 '900.0',
 '420.0',
 '1580.0',
 '1380.0',
 '475.0',
 '690.0',
 '270.0',
 '350.0',
 '935.0',
 '1370.0',
 '980.0',
 '1470.0',
 '160.0',
 '950.0',
 '50.0',
 '740.0',
 '1780.0',
 '1900.0',
 '340.0',
 '470.0',
 '370.0',
 '140.0',
 '1760.0',
 '130.0',
 '520.0',
 '890.0',
 '1110.0',
 '150.0',
 '1720.0',
 '810.0',
 '190.0',
 '1290.0',
 '670.0',
 '1800.0',
 '1120.0',
 '1810.0',
 '60.0',
 '1050.0',
 '940.0',
 '310.0',
 '930.0',
 '1390.0',
 '610.0',
 '1830.0',
 '1300.0',
 '510.0',
 '1330.0',
 '1590.0',
 '920.0',
 '1320.0',
 '1420.0',
 '1240.0',
 '1960.0',
 '1560.0',
 '2020.0',
 '1190.0',
 '2110.0',
 '1280.0',
 '250.0',
 '2390.0',
 '1230.0',
 '170.0',
 '830.0',
 '1260.0',
 '1410.0',
 '1340.0',
 '590.0',
 '1500.0',
 '1140.0',
 '260.0',
 '100.0',
 '320.0',
 '1480.0',
 '1060.0',
 '1284.0',
 '1670.0',
 '1350.0',
 '2570.0',
 '1090.0',
 '110.0',
 '2500.0',
 '90.0',
 '1940.0',
 '1550.0',
 '2350.0',
 '2490.0',
 '1481.0',
 '1360.0',
 '1135.0',
 '1520.0',
 '1850.0',
 '1660.0',
 '2130.0',
 '2600.0',
 '1690.0',
 '243.0',
 '1210.0',
 '1024.0',
 '1798.0',
 '1610.0',
 '1440.0',
 '1570.0',
 '1650.0',
 '704.0',
 '1910.0',
 '1630.0',
 '2360.0',
 '1852.0',
 '2090.0',
 '2400.0',
 '1790.0',
 '2150.0',
 '230.0',
 '70.0',
 '1680.0',
 '2100.0',
 '3000.0',
 '1870.0',
 '1710.0',
 '2030.0',
 '875.0',
 '1540.0',
 '2850.0',
 '2170.0',
 '506.0',
 '906.0',
 '145.0',
 '2040.0',
 '784.0',
 '1750.0',
 '374.0',
 '518.0',
 '2720.0',
 '2730.0',
 '1840.0',
 '3480.0',
 '2160.0',
 '1920.0',
 '2330.0',
 '1860.0',
 '2050.0',
 '4820.0',
 '1913.0',
 '80.0',
 '2010.0',
 '3260.0',
 '2200.0',
 '415.0',
 '1730.0',
 '652.0',
 '2196.0',
 '1930.0',
 '515.0',
 '40.0',
 '2080.0',
 '2580.0',
 '1548.0',
 '1740.0',
 '235.0',
 '861.0',
 '1890.0',
 '2220.0',
 '792.0',
 '2070.0',
 '4130.0',
 '2250.0',
 '2240.0',
 '1990.0',
 '768.0',
 '2550.0',
 '435.0',
 '1008.0',
 '2300.0',
 '2610.0',
 '666.0',
 '3500.0',
 '172.0',
 '1816.0',
 '2190.0',
 '1245.0',
 '1525.0',
 '1880.0',
 '862.0',
 '946.0',
 '1281.0',
 '414.0',
 '2180.0',
 '276.0',
 '1248.0',
 '602.0',
 '516.0',
 '176.0',
 '225.0',
 '1275.0',
 '266.0',
 '283.0',
 '65.0',
 '2310.0',
 '10.0',
 '1770.0',
 '2120.0',
 '295.0',
 '207.0',
 '915.0',
 '556.0',
 '417.0',
 '143.0',
 '508.0',
 '2810.0',
 '20.0',
 '274.0',
 '248.0']

In [29]:
true_objects = []
for val in df.sqft_basement.unique().tolist():
    try:
        float(val)
    except ValueError:
        true_objects.append(val)
print(true_objects)

['?']

removing the '?' entry, so that sqft_basement can be integer

In [36]:
df = df[df.sqft_basement != '?']

In [100]:
df['sqft_basement'] = df.sqft_basement.astype(float, inplace=True)

refuses integer. settling on float

In [94]:
true_objects = []
for val in df.sqft_basement.unique().tolist():
    try:
        float(val)
    except ValueError:
        true_objects.append(val)
print(true_objects)

[]

In [99]:
df.sqft_basement.dtype

dtype('float64')

In [102]:
df.yr_renovated.describe()

count    17389.000000
mean        82.991949
std        398.481819
min          0.000000
25%          0.000000
50%          0.000000
75%          0.000000
max       2015.000000
Name: yr_renovated, dtype: float64

In [103]:
df.yr_renovated[df.yr_renovated > 0].describe()

count     723.000000
mean     1996.053942
std        15.430251
min      1934.000000
25%      1987.000000
50%      2000.000000
75%      2007.500000
max      2015.000000
Name: yr_renovated, dtype: float64

In [109]:
df.yr_renovated[df.yr_renovated == 0].shape[0]

16666

In [107]:
df.yr_renovated.shape[0]

21143

yr_renovated is mostly empty, so drop it

In [116]:
df.drop(['yr_renovated'], axis=1, inplace=True);

In [117]:
df.head(0)

Empty DataFrame
Columns: [date, price, bedrooms, bathrooms, sqft_living, sqft_lot, floors, waterfront, view, condition, grade, sqft_above, sqft_basement, yr_built, zipcode, lat, long, sqft_living15, sqft_lot15]
Index: []

#### Convert Categorical data encoded as integers to String type

categoricals hiding as integers

In [138]:
df.select_dtypes(include='int64').head()

,bedrooms,sqft_living,sqft_lot,condition,grade,sqft_above,yr_built,zipcode,sqft_living15,sqft_lot15
0,3,1180,5650,3,7,1180,1955,98178,1340,5650
1,3,2570,7242,3,7,2170,1951,98125,1690,7639
2,2,770,10000,3,6,770,1933,98028,2720,8062
3,4,1960,5000,5,7,1050,1965,98136,1360,5000
4,3,1680,8080,3,8,1680,1987,98074,1800,7503

are categorical vars: yr_built, zipcode

bedroom, condition, grade, are probably discrete numerical

yr_built could be converted to 'age', a numerical var

the rest are true integers

In [147]:
age_temp = df.yr_built

In [150]:
df['zipcode'] = df.zipcode.astype(object)

categoricals hiding as floats

In [151]:
df.select_dtypes(include='float64').head(2)

,price,bathrooms,floors,waterfront,view,sqft_basement,lat,long
0,221900.0,1.00,1.0,NaN,0.0,0.0,47.5112,-122.257
1,538000.0,2.25,2.0,0.0,0.0,400.0,47.7210,-122.319

In [145]:
df.waterfront.describe()

count    18804.000000
mean         0.007552
std          0.086573
min          0.000000
25%          0.000000
50%          0.000000
75%          0.000000
max          1.000000
Name: waterfront, dtype: float64

waterfront is binary and therefore categorical

In [152]:
df.waterfront = df.waterfront.astype(object)

In [156]:
df.view.unique()

array([ 0., nan,  3.,  4.,  2.,  1.])

#### Handle nulls